# Assignment 2 Homework 4

### Imports (compatible for Python 2 and Python 3)

In [2]:
#import necassary packages
try:
    import urllib2 as ulib
except ImportError:
    import urllib3 as ulib

try:
    from StringIO import BytesIO as io
except ImportError:
    from io import BytesIO as io

try:
    from urllib import urlencode as urlencode
except ImportError:
    from urllib.parse import urlencode as urlencode
    
try:
    from urllib import urlopen as urlopen
except ImportError:
    from urllib.request import urlopen as urlopen
    
try:
    from urllib2 import HTTPError as HTTPError
except ImportError:
    from urllib.error import HTTPError as HTTPError

import ast
import pandas as pd

In [3]:
#function from class that conntects to the api 
API_URL = 'https://fb55.carto.com:443/api/v2/sql?q='

def queryCartoDB(query, formatting = 'CSV', source = API_URL):
    '''queries carto datasets from a given carto account
    Arguments: 
    query - string: a valid sql query string
    format - outlut format  OPTIONAL (default CSV)
    source - a valid sql api endpoint OPTIONAL (default carto fb55 account)
    Returns:
    the return of the sql query AS A STRING
    NOTES:
    designed for the carto API, tested only with CSV return format'''
    
    
    data = urlencode({'format': formatting, 'q': query}).encode("utf-8")
    try:
        response = urlopen(source, data)
        return response.read()
    except HTTPError as e:
        raise (ValueError('\n'.join(ast.literal_eval(e.readline())['error'])))
        
def get_data(query):
    try:
        return pd.read_csv(io(queryCartoDB(query)), sep = ',')
    except ValueError as v:
        print (str(v))

In [4]:
#test
query = '''SELECT * FROM fb55.citibike; '''
table = get_data(query)
table.head(5)

,the_geom,start_station_longitude,the_geom_webmercator,tripduration,starttime,stoptime,start_station_id,start_station_name,start_station_latitude,cartodb_id,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bikeid,usertype,birth_year,gender
0,NaN,-73.994811,NaN,801,2/1/2015 0:00,2/1/2015 0:14,521,8 Ave & W 31 St,40.750450,1,423,W 54 St & 9 Ave,40.765849,-73.986905,17131,Subscriber,1978.0,2
1,NaN,-73.985649,NaN,245,2/1/2015 1:03,2/1/2015 1:07,438,St Marks Pl & 1 Ave,40.727791,89,297,E 15 St & 3 Ave,40.734232,-73.986923,20142,Subscriber,1990.0,1
2,NaN,-73.990093,NaN,379,2/1/2015 0:00,2/1/2015 0:07,497,E 17 St & Broadway,40.737050,2,504,1 Ave & E 15 St,40.732219,-73.981656,21289,Subscriber,1993.0,1
3,NaN,-73.973715,NaN,2474,2/1/2015 0:01,2/1/2015 0:42,281,Grand Army Plaza & Central Park S,40.764397,3,127,Barrow St & Hudson St,40.731724,-74.006744,18903,Subscriber,1969.0,2
4,NaN,-74.004704,NaN,818,2/1/2015 0:01,2/1/2015 0:15,2004,6 Ave & Broome St,40.724399,4,505,6 Ave & W 33 St,40.749013,-73.988484,21044,Subscriber,1985.0,2

### Task 1.1
Sort data by both: start_station_id ascending, and tripduration descending (hint: ASC, DESC);

In [5]:
get_data ('''SELECT * FROM fb55.citibike \
ORDER BY start_station_id ASC, tripduration DESC''').head()

,the_geom,start_station_longitude,the_geom_webmercator,tripduration,starttime,stoptime,start_station_id,start_station_name,start_station_latitude,cartodb_id,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bikeid,usertype,birth_year,gender
0,NaN,-73.978034,NaN,511,2/1/2015 0:50,2/1/2015 0:59,119,Park Ave & St Edwards St,40.696089,75,420,Clermont Ave & Lafayette Ave,40.687645,-73.969689,20792,Subscriber,1982.0,1
1,NaN,-74.002971,NaN,907,2/1/2015 0:17,2/1/2015 0:32,128,MacDougal St & Prince St,40.727103,26,531,Forsyth St & Broome St,40.718939,-73.992663,16917,Subscriber,1993.0,1
2,NaN,-74.002971,NaN,731,2/1/2015 1:11,2/1/2015 1:23,128,MacDougal St & Prince St,40.727103,92,502,Henry St & Grand St,40.714215,-73.981346,19506,Subscriber,1970.0,1
3,NaN,-74.002971,NaN,521,2/1/2015 2:29,2/1/2015 2:38,128,MacDougal St & Prince St,40.727103,166,276,Duane St & Greenwich St,40.717488,-74.010455,15023,Subscriber,1965.0,1
4,NaN,-74.002971,NaN,428,2/1/2015 1:54,2/1/2015 2:02,128,MacDougal St & Prince St,40.727103,142,312,Allen St & E Houston St,40.722055,-73.989111,21462,Subscriber,1983.0,1

### Task 1.2 
Select last 10 records of the table. Hint: use the table’s main id field;

In [7]:
get_data ('''SELECT * FROM fb55.citibike \
ORDER BY cartodb_id DESC \
LIMIT 10''').head()

,the_geom,start_station_longitude,the_geom_webmercator,tripduration,starttime,stoptime,start_station_id,start_station_name,start_station_latitude,cartodb_id,end_station_id,end_station_name,end_station_latitude,end_station_longitude,bikeid,usertype,birth_year,gender
0,NaN,-73.976485,NaN,339,2/1/2015 3:47,2/1/2015 3:53,520,W 52 St & 5 Ave,40.759923,199,153,E 40 St & 5 Ave,40.752062,-73.981632,17389,Subscriber,1963,1
1,NaN,-73.977724,NaN,861,2/1/2015 3:45,2/1/2015 4:00,511,E 14 St & Avenue B,40.729387,198,335,Washington Pl & Broadway,40.729039,-73.994046,17927,Subscriber,1972,1
2,NaN,-73.999318,NaN,445,2/1/2015 3:44,2/1/2015 3:52,482,W 15 St & 7 Ave,40.739355,197,504,1 Ave & E 15 St,40.732219,-73.981656,18968,Subscriber,1990,1
3,NaN,-73.991255,NaN,412,2/1/2015 3:42,2/1/2015 3:49,479,9 Ave & W 45 St,40.760193,196,267,Broadway & W 36 St,40.750977,-73.987654,15185,Subscriber,1988,1
4,NaN,-74.003664,NaN,232,2/1/2015 3:41,2/1/2015 3:44,434,9 Ave & W 18 St,40.743174,195,494,W 26 St & 8 Ave,40.747348,-73.997236,17751,Subscriber,1975,1

### Task 1.3 
List all unique birth years. Hint: distinct;

In [9]:
get_data ('''SELECT DISTINCT birth_year FROM fb55.citibike \
WHERE birth_year IS NOT NULL
ORDER BY birth_year''')

    birth_year  Unnamed: 1
0         1954         NaN
1         1955         NaN
2         1957         NaN
3         1958         NaN
4         1959         NaN
5         1960         NaN
6         1961         NaN
7         1963         NaN
8         1964         NaN
9         1965         NaN
10        1966         NaN
11        1967         NaN
12        1968         NaN
13        1969         NaN
14        1970         NaN
15        1971         NaN
16        1972         NaN
17        1973         NaN
18        1974         NaN
19        1975         NaN
20        1976         NaN
21        1977         NaN
22        1978         NaN
23        1979         NaN
24        1980         NaN
25        1981         NaN
26        1982         NaN
27        1983         NaN
28        1984         NaN
29        1985         NaN
30        1986         NaN
31        1987         NaN
32        1988         NaN
33        1989         NaN
34        1990         NaN
35        1991         NaN
36        1992         NaN
37        1993         NaN
38        1994         NaN
39        1995         NaN

### TASK 1.4 
Find minimal, maximal and average trip duration
hint: min(), max(), avg().

In [10]:
get_data('''SELECT min(tripduration), max(tripduration), avg(tripduration) 
FROM fb55.citibike''')

   min    max         avg
0   89  35251  775.527638

### TASK 2.1 
Select only trips that started at 1 AM

In [13]:
get_data('''SELECT bikeid FROM fb55.citibike \
WHERE EXTRACT(HOUR FROM stoptime::time) = 1 ''').head()

   bikeid  Unnamed: 1
0   20142         NaN
1   20530         NaN
2   15667         NaN
3   16301         NaN
4   18344         NaN

### TASK 2.2
What is the average birth year of people that ride bikes at 2 AM?;

In [15]:
get_data('''SELECT AVG(birth_year) FROM fb55.citibike \
WHERE EXTRACT(HOUR FROM starttime::time) = 2 ''')

           avg  Unnamed: 1
0  1981.129032         NaN

### TASK 2.3
What is the age of the oldest person riding at 3 AM?

In [18]:
get_data('''SELECT 2018 - MIN(birth_year) FROM fb55.citibike \
WHERE EXTRACT(HOUR FROM starttime::time) = 3 ''')

   ?column?  Unnamed: 1
0        64         NaN

### TASK 3.1
Find the “start_station_id” that had the highest number of bikes taken from it

In [20]:
get_data('''SELECT start_station_id, count(*) FROM fb55.citibike \
GROUP BY start_station_id
ORDER BY 2 DESC
LIMIT 2''')

   start_station_id  count
0               285      6
1               250      6

In [ ]:
#two stations have 6 bikes taken from it

### TASK 3.2
Show top 3 “end_station_id” with the largest total “tripduration”. Hint: GROUP BY station id, SUM();

In [23]:
get_data('''SELECT end_station_id, SUM(tripduration) as duration
FROM fb55.citibike
GROUP BY end_station_id
ORDER BY duration DESC
LIMIT 3
''')

   end_station_id  duration
0             525     35251
1             237      4297
2             127      3806

### TASK 3.3
Find the “start_station_id” with the shortest average trip duration during 1 AM.

In [46]:
get_data('''SELECT start_station_id, AVG(tripduration) as avg_duration
FROM fb55.citibike
WHERE EXTRACT(HOUR FROM starttime::time) = 1
GROUP BY start_station_id
ORDER BY avg_duration ASC
LIMIT 1''')

   start_station_id  avg_duration
0               486         114.0